# 2022计网实验指令参考

## 配置各 PC 与 Router 接口的 IP 地址

### 配置各 PC (手动)

| PC   | IPv4 Address | Subnet Mask   | Default Gateway |
| ---- | ------------ | ------------- | --------------- |
| PC0  | 192.168.10.2 | 255.255.255.0 | 192.168.10.1    |
| PC1  | 192.168.20.2 | 255.255.255.0 | 192.168.20.1    |
| PC2  | 192.168.40.2 | 255.255.255.0 | 192.168.40.1    |
| PC3  | 192.168.60.2 | 255.255.255.0 | 192.168.60.1    |
| PC4  | 192.168.30.2 | 255.255.255.0 | 192.168.30.1    |
| PC5  | 192.168.10.4 | 255.255.255.0 | 192.168.10.1    |



### 配置 RA

```
Router>enable
Router#conf t
Router(config)#hostname RA
RA(config)#interface g0/0/0
RA(config-if)#no ip address
RA(config-if)#no shutdown
RA(config-if)#exit
RA(config)#interface g0/0/0.10
RA(config-subif)#encapsulation dot1q 10	//dot后面是数字1
RA(config-subif)#ip address 192.168.10.1 255.255.255.0
RA(config-subif)#exit
RA(config)#interface g0/0/0.20
RA(config-subif)#encapsulation dot1q 20
RA(config-subif)#ip address 192.168.20.1 255.255.255.0
RA(config-subif)#exit
RA(config)#interface g0/0/1
RA(config-if)#ip address 192.168.30.1 255.255.255.0
RA(config-if)#no shutdown
RA(config-if)#exit
```



### 配置 RB

```
Router>enable
Router#conf t
Router(config)#hostname RB
RB(config)#interface g0/0/0
RB(config-if)#ip address 192.168.10.3 255.255.255.0
RB(config-if)#no shutdown
RB(config-if)#exit
RB(config)#interface g0/0/1
RB(config-if)#ip address 192.168.50.1 255.255.255.0
RB(config-if)#no shutdown
RB(config-if)#exit
```



### 配置 RC

```
Router>enable
Router#conf t
Router(config)#hostname RC
RC(config)#interface g0/0/0
RC(config-if)#ip address 192.168.50.2 255.255.255.0
RC(config-if)#no shutdown
RC(config-if)#exit
RC(config)#interface g0/0/1
RC(config-if)#ip address 192.168.60.1 255.255.255.0
RC(config-if)#no shutdown
RC(config-if)#exit
```



### 配置 RD

```
Router>enable
Router#conf t
Router(config)#hostname RD
RD(config)#interface g0/0/0
RD(config-if)#ip address 192.168.20.3 255.255.255.0
RD(config-if)#no shutdown
RD(config-if)#exit
RD(config)#interface g0/0/1
RD(config-if)#ip address 192.168.40.1 255.255.255.0
RD(config-if)#no shutdown
RD(config-if)#exit
```



### 测试 RB 和 RC 间和 Router 与 PC 间的连通性

```
RA#ping 192.168.30.2 
RB#ping 192.168.50.2
RB#ping 192.168.10.4
RC#ping 192.168.50.1
RC#ping 192.168.60.2
RD#ping 192.168.40.2

PC2>ping 192.168.40.1
PC3>ping 192.168.60.1
PC4>ping 192.168.30.1
```



## 配置两台 Switch 的 VLAN 分配与 Trunk Port

### 配置 SA

```
Switch>enable
Switch#conf t
Switch(config)#hostname SA
SA(config)#interface g1/0/24
SA(config-if)#switchport mode trunk
SA(config-if)#exit
SA(config)#interface g1/0/1
SA(config-if)#switchport mode trunk
SA(config-if)#exit
SA(config)#vlan 10
SA(config-vlan)#exit
SA(config)#vlan 20
SA(config-vlan)#exit
SA(config)#interface g1/0/2
SA(config-if)#switchport mode access
SA(config-if)#switchport access vlan 10
SA(config-if)#exit
SA(config)#interface g1/0/23
SA(config-if)#switchport mode access
SA(config-if)#switchport access vlan 20
SA(config-if)#exit
```



### 配置 SB

```
Switch>enable
Switch#conf t
Switch(config)#hostname SB
SB(config)#interface g1/0/24
SB(config-if)#switchport mode trunk
SB(config-if)#exit
SB(config)#vlan 10
SB(config-vlan)#exit
SB(config)#vlan 20
SB(config-vlan)#exit
SB(config)#interface g1/0/2
SB(config-if)#switchport mode access
SB(config-if)#switchport access vlan 10
SB(config-if)#exit
SB(config)#interface g1/0/3
SB(config-if)#switchport mode access
SB(config-if)#switchport access vlan 10
SB(config-if)#exit
SB(config)#interface g1/0/23
SB(config-if)#switchport mode access
SB(config-if)#switchport access vlan 20
SB(config-if)#exit
```



### VLAN 连通性测试

```
PC0>ping 192.168.20.2	//PC1
PC0>ping 192.168.10.3	//RB
```



## 在各 Router 上配置 OSPF

```
RA(config)#interface lo0
RA(config-if)#ip address 10.0.0.X 255.255.255.255	//其中RA的X为1，其余类推递增
RA(config-if)#exit
RA(config)#router ospf 1
RA(config-router)#network 192.168.10.0 0.0.0.255 area 0
RA(config-router)#network 192.168.20.0 0.0.0.255 area 0
RA(config-router)#network 192.168.30.0 0.0.0.255 area 0

RB(config)#interface lo0
RB(config-if)#ip address 10.0.0.2 255.255.255.255
RB(config-if)#exit
RB(config)#router ospf 1
RB(config-router)#network 192.168.10.0 0.0.0.255 area 0
RB(config-router)#network 192.168.50.0 0.0.0.255 area 0

RC(config)#interface lo0
RC(config-if)#ip address 10.0.0.3 255.255.255.255
RC(config-if)#exit
RC(config)#router ospf 1
RC(config-router)#network 192.168.50.0 0.0.0.255 area 0
RC(config-router)#network 192.168.60.0 0.0.0.255 area 0

RD(config)#interface lo0
RD(config-if)#ip address 10.0.0.4 255.255.255.255
RD(config-if)#exit
RD(config)#router ospf 1
RD(config-router)#network 192.168.20.0 0.0.0.255 area 0
RD(config-router)#network 192.168.40.0 0.0.0.255 area 0
```



### OSPF 连通性测试

```
//PC2 <-> PC4
PC2>ping 192.168.30.2
PC4>ping 192.168.40.2
//PC0 <-> PC3
PC0>ping 192.168.60.2
PC3>ping 192.168.10.2	
//PC1 <-> PC5
PC1>ping 192.168.10.4	
PC5>ping 192.168.20.2
```



## RD 的 NAT 配置

```
RD(config)#access-list 1 permit 192.168.40.0 0.0.0.255
RD(config)#ip nat pool exam 192.168.20.4 192.168.20.4 netmask 255.255.255.0
// 注意：Netmask 可能有 netmask A.B.C.D 与 prefix-length N 两种语法，实际操作请输入 `?` 确认
RD(config)#ip nat inside source list 1 pool exam
RD(config)#interface g0/0/0
RD(config-if)#ip nat outside
RD(config-if)#exit
RD(config)#interface g0/0/1
RD(config-if)#ip nat inside
RD(config-if)#exit
RD#show ip nat translations
```



### NAT 连通性测试

```
PC0>ping 192.168.40.2	//PC2

RD#show ip nat translations
```



## RC 的 ACL 配置

```
RC(config)#access-list 100 deny icmp host 192.168.10.4 host 192.168.60.2
RC(config)#access-list 100 permit icmp any any
RC(config)#interface g0/0/0
RC(config-if)#ip access-group 100 in
```



### ACL 连通性测试

```
PC5>ping 192.168.60.2	//PC3
```

